function name1 = get_name1(d)
    % k_means 聚类高钾玻璃输出结果
    name = ["高Ca-Al玻璃"
    "Ca-Al玻璃"
    "高Cu-Fe玻璃"
    "高Al-P玻璃"
    "高Al-Fe玻璃"
    ];
    
    center = [7.964543368,8.874710471,1.234466597,1.196582997,0.764372123;
    1.120877118,3.343315663,0.722129633,0.664052795,0.673333333;
    6.165117519,5.85903223,3.670250939,2.186512555,1.31775153;
    0,11.15,2.51,2.39,4.18;
    5.41,10.05,2.18,6.04,4.5;
    ]; % 聚类中心
     
    idx = [4,6,8,7,11];

    d = d(idx);
    dis = zeros(5,1);
    for h = 1:5
        dis(h) = sum((d-center(h,:)).^2);
    end
    [~,id] = min(dis);
    id 
    name1 = name(id);
end